Revit 2027 API
FBXExportOptions.UseLevelsOfDetail Property
True to use levels of detail, false otherwise.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseLevelsOfDetail { get; set; }
Public Property UseLevelsOfDetail As Boolean
	Get
	Set
public:
property bool UseLevelsOfDetail {
	bool get ();
	void set (bool value);
}
member UseLevelsOfDetail : bool with get, set
Property Value
Boolean
The default value is false.
See Also
Reference
FBXExportOptions Class
Autodesk.Revit.DB Namespace